1.oneDimensionalAdvectionDiffusion/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver			functions;

subSolver		incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;			// second

deltaT          0.01;		// based on this we have 1000 time steps C0 = U* dt/dx; C0 =0.5 is a good choice

writeControl    timeStep;	// adjustableRunTime 

writeInterval   10;			// changed it from 100 

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions					// We have added this for the temperature to be solved and transported which is called passive scaler 
{
	#includeFunc scalarTransport(T, diffusivity=none)
}


// ************************************************************************* //
